In [12]:
import pandas as pd
import numpy as np

In [13]:
# Create dataframe using dictionary
data = {'Student ID': [10, 11, 12, 13, 14], 
        'Age': [23, 22, 24, 22, 25],
        'Weight': [66, 72, np.inf, 68, -np.inf]}
  
df = pd.DataFrame(data)

In [14]:
ds

   Student ID    Age  Weight
0       False  False   False
1       False  False   False
2       False  False    True
3       False  False   False
4       False  False    True

In [15]:
# Count infinite values in whole DataFrame
count = np.isinf(df).values.sum()
count

2

In [16]:
# counting infinity in a particular column name
c = np.isinf(df['Weight']).values.sum()
c

2

In [21]:
np.isinf(df).any()

Student ID    False
Age           False
Weight         True
dtype: bool

##### Dropping inf values

In [24]:
df

   Student ID  Age  Weight
0          10   23    66.0
1          11   22    72.0
2          12   24     inf
3          13   22    68.0
4          14   25    -inf

In [27]:
df.replace({np.inf:np.nan, -np.inf:np.nan}, inplace=True)

In [29]:
df

   Student ID  Age  Weight
0          10   23    66.0
1          11   22    72.0
2          12   24     NaN
3          13   22    68.0
4          14   25     NaN

In [30]:
# Now we can drop the values

In [31]:
df.dropna(axis=1, how='any')

   Student ID  Age
0          10   23
1          11   22
2          12   24
3          13   22
4          14   25